test/resources/action/ie4r02-v2-single-slash-action-element.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v2="http://xmlns.ec.eu/BusinessActivityService/ICS/IReferralManagementBAS/V2" xmlns:urn="urn:wco:datamodel:eu:ics2:2">
   <soap:Header>
      <soap:Action>/</soap:Action>
   </soap:Header>
   <soap:Body>
      <v2:IE4R02provideAdditionalInformationReqMsg>
         <urn:IE4R02>
            <urn:MessageHeader>
               <urn:messageId>?</urn:messageId>
               <!--Optional:-->
               <urn:correlationId>?</urn:correlationId>
               <!--Optional:-->
               <urn:replyToMessageId>?</urn:replyToMessageId>
               <urn:messageTimestamp>?</urn:messageTimestamp>
               <urn:messageSender>?</urn:messageSender>
               <urn:messageRecipient>?</urn:messageRecipient>
               <!--Optional:-->
               <urn:conformanceCampaign>?</urn:conformanceCampaign>
            </urn:MessageHeader>
            <urn:documentIssueDate>
               <urn:DateTime>?</urn:DateTime>
            </urn:documentIssueDate>
            <urn:MRN>?</urn:MRN>
            <urn:responsibleMemberState>
               <urn:country>?</urn:country>
            </urn:responsibleMemberState>
            <!--Optional:-->
            <urn:representative>
               <urn:identificationNumber>?</urn:identificationNumber>
            </urn:representative>
            <!--Optional:-->
            <urn:transportDocument>
               <urn:documentNumber>?</urn:documentNumber>
               <urn:type>?</urn:type>
            </urn:transportDocument>
            <urn:declarant>
               <urn:identificationNumber>?</urn:identificationNumber>
            </urn:declarant>
            <!--1 to 999 repetitions:-->
            <urn:additionalInformationResponse>
               <urn:referralRequestReference>d4af29b4-d1d7-4f42-a186-ca5a71fab</urn:referralRequestReference>
               <!--0 to 99 repetitions:-->
               <urn:additionalInformation>
                  <!--Optional:-->
                  <urn:code>?</urn:code>
                  <!--Optional:-->
                  <urn:text>?</urn:text>
                  <!--Optional:-->
                  <urn:type>?</urn:type>
               </urn:additionalInformation>
               <!--0 to 9 repetitions:-->
               <urn:binaryAttachment>
                  <urn:filename>?</urn:filename>
                  <!--Optional:-->
                  <urn:URI>?</urn:URI>
                  <!--Optional:-->
                  <urn:MIME>?</urn:MIME>
                  <!--Optional:-->
                  <urn:includedBinaryObject>dGhlIHF1aWNrIGJyb3duIGZveCBqdW1wcyBvdmVyIHRoZSBsYXp5IGRvZwo=</urn:includedBinaryObject>
                  <!--Optional:-->
                  <urn:description>?</urn:description>
               </urn:binaryAttachment>
               <!--Optional:-->
               <urn:transportDocumentHouseLevel>
                  <urn:documentNumber>?</urn:documentNumber>
                  <urn:type>?</urn:type>
               </urn:transportDocumentHouseLevel>
            </urn:additionalInformationResponse>
            <!--0 to 999 repetitions:-->
            <urn:hrcmScreeningResults>
               <urn:result>?</urn:result>
               <!--2 to 9 repetitions:-->
               <urn:screeningMethod>
                  <urn:method>?</urn:method>
               </urn:screeningMethod>
               <urn:screeningMethod>
                  <urn:method>?</urn:method>
               </urn:screeningMethod>
               <!--0 to 99 repetitions:-->
               <urn:additionalInformation>
                  <!--Optional:-->
                  <urn:code>?</urn:code>
                  <!--Optional:-->
                  <urn:text>?</urn:text>
                  <!--Optional:-->
                  <urn:type>?</urn:type>
               </urn:additionalInformation>
               <urn:authorizedPerson>
                  <urn:name>?</urn:name>
                  <urn:identificationNumber>?</urn:identificationNumber>
                  <urn:typeOfPerson>?</urn:typeOfPerson>
               </urn:authorizedPerson>
               <!--Optional:-->
               <urn:facilityPlace>
                  <urn:address>
                     <urn:city>?</urn:city>
                     <urn:country>?</urn:country>
                     <!--Optional:-->
                     <urn:subDivision>?</urn:subDivision>
                     <!--Optional:-->
                     <urn:street>?</urn:street>
                     <!--Optional:-->
                     <urn:postCode>?</urn:postCode>
                     <!--Optional:-->
                     <urn:streetAdditionalLine>?</urn:streetAdditionalLine>
                     <!--Optional:-->
                     <urn:number>?</urn:number>
                     <!--Optional:-->
                     <urn:poBox>?</urn:poBox>
                  </urn:address>
               </urn:facilityPlace>
               <urn:transportDocumentHouseLevel>
                  <urn:documentNumber>?</urn:documentNumber>
                  <urn:type>?</urn:type>
               </urn:transportDocumentHouseLevel>
            </urn:hrcmScreeningResults>
         </urn:IE4R02>
      </v2:IE4R02provideAdditionalInformationReqMsg>
   </soap:Body>
</soap:Envelope>